cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'homebrew/services'
tap 'homebrew/completions'
tap 'homebrew/devel-only'
tap 'homebrew/command-not-found'
tap 'eqnxio/ngrok'
tap 'd12frosted/emacs-plus'
tap 'homebrew/dupes'
tap 'getantibody/tap'
tap 'neovim/neovim'

brew 'ack'
brew 'ag'
brew 'ansible'
brew 'antibody'
brew 'aspell', args: ['--with-lang-en']
brew 'awscli'
brew 'aws-elasticbeanstalk'
brew 'cairo'
brew 'diff-so-fancy'
brew 'editorconfig'
brew 'elixir'
brew 'emacs-plus', args: ["--HEAD", "--with-natural-title-bars"]
brew 'eqnxio/ngrok/ngrok'
brew 'exa'
brew 'ffmpeg'
brew 'freetype'
brew 'fontconfig'
brew 'fzf'
brew 'gdk-pixbuf'
brew 'git'
brew 'glib'
brew 'gobject-introspection'
brew 'gpg'
brew 'gpg-agent'
brew 'grc'
brew 'grep'
brew 'gzip'
brew 'harfbuzz'
brew 'heroku'
brew 'htop-osx'
brew 'imagemagick@6'
brew 'jq'
brew 'libcroco'
brew 'librsvg'
brew 'mackup'
brew 'mas'
brew 'neovim'
brew 'nvm'
brew 'packer'
brew 'pango'
brew 'pinentry-mac'
brew 'pixman'
brew 'postgres'
brew 'rbenv'
brew 'roundup'
brew 'ruby-build'
brew 'shellcheck'
brew 'shfmt'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'terraform'
brew 'terraform-docs'
brew 'trash'
brew 'tree'
brew 'the_silver_searcher'
brew 'unrar'
brew 'vim', args: ['--override-system-vi']
brew 'wget'
brew 'yarn'
brew 'zsh'

# gnu stuff
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'

# casks
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

cask '1password-cli'
cask 'alfred'
cask 'backblaze'
cask 'bartender'
cask 'caffeine'
cask 'cheatsheet'
cask 'cleanmymac'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'duet'
cask 'encryptme'
cask 'fantastical'
cask 'franz'
cask 'firefox'
cask 'gitter'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-cloud-sdk'
cask 'grammarly'
cask 'gyazo'
cask 'imagealpha'
cask 'imageoptim'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'java'
cask 'java8'
cask 'kap'
cask 'keybase'
cask 'kitematic'
cask 'limechat'
cask 'rescuetime'
cask 'skype'
cask 'slack'
cask 'slate'
cask 'spotify'
cask 'telegram'
cask 'transmit'
cask 'transmission'
cask 'the-unarchiver'
cask 'tunnelbear'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'

# https://github.com/sindresorhus/quick-look-plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# fonts
cask 'caskroom/fonts/font-anonymouspro-nerd-font-mono'
cask 'caskroom/fonts/font-awesome-terminal-fonts'
cask 'caskroom/fonts/font-fira-code'


# MacApp Store Apps
mas "Evernote", id: 406056744
mas "Kindle", id: 405399194
mas "Pages", id: 409201541
mas "Trello", id: 1278508951
mas "iStat Mini", id: 927292435
mas "1Password", id: 443987910
mas "zik-manager", id: 1050660598
mas "Marked 2", id: 890031187
mas "Todoist", id: 585829637
mas "Newton", id: 1059655371
mas "Monodraw", id: 920404675
mas "kset", id: 847496013
mas "Tweetbot", id: 557168941
