cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'eqnxio/ngrok'
tap 'getantibody/tap'
tap 'neovim/neovim'
tap 'heroku/brew'
tap 'nektos/tap'


brew 'ack'
brew 'act'
brew 'adr-tools'
brew 'ag'
brew 'antibody'
brew 'awscli'
brew 'aws-elasticbeanstalk'
brew 'bat'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'editorconfig'
brew 'eqnxio/ngrok/ngrok'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'gdk-pixbuf'
brew 'git'
brew 'glib'
brew 'gpg'
brew 'grc'
brew 'grep'
brew 'gzip'
brew 'heroku'
brew 'htop-osx'
brew 'hub'
brew 'imagemagick@6'
brew 'ispell'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'mkcert'
brew 'neovim'
brew 'ngrep'
brew 'nmap'
brew 'openssl'
brew 'pango'
brew 'pinentry-mac'
brew 'prettyping'
brew 'roundup'
brew 'ssh-copy-id'
brew 'terraform'
brew 'terraform-docs'
brew 'thefuck'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'zsh'

# gnu stuff
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'

# casks
unless ENV["CI"]
  tap 'homebrew/cask-versions'

  cask 'alfred'
  cask 'backblaze'
  cask 'bartender'
  cask 'caffeine'
  cask 'cleanmymac'
  cask 'dash'
  cask 'docker'
  cask 'fantastical'
  cask 'figma'
  cask 'google-chrome'
  cask 'google-cloud-sdk'
  cask 'google-drive-file-stream'
  cask 'grammarly'
  cask 'graphiql'
  cask 'iconjar'
  cask 'iterm2'
  cask 'kap'
  cask 'keybase'
  cask 'little-snitch'
  cask 'nordvpn'
  cask 'sizzy'
  cask 'slack'
  cask 'sublime-merge-dev'
  cask 'sublime-text-dev'
  cask 'the-unarchiver'
end

# MacApp Store Apps
unless ENV["CI"]
  mas "Kindle", id: 405399194
  mas "Keynote", id: 409183694
  mas "Numbers", id: 409203825
  mas "Pages", id: 409201541
  mas "1Password", id: 1333542190
  mas "Marked 2", id: 890031187
  mas "Todoist", id: 585829637
  mas "Bear", id: 1091189122
end
