cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'eqnxio/ngrok'
tap 'd12frosted/emacs-plus'
tap 'getantibody/tap'
tap 'neovim/neovim'
tap 'heroku/brew'
tap 'semaphoreci/tap'
tap 'nektos/tap'


brew 'ack'
brew 'act'
brew 'adr-tools'
brew 'ag'
brew 'antibody'
brew 'awscli'
brew 'aws-elasticbeanstalk'
brew 'bat'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'editorconfig'
brew 'eqnxio/ngrok/ngrok'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'gdk-pixbuf'
brew 'git'
brew 'glib'
brew 'gpg'
brew 'grc'
brew 'grep'
brew 'gzip'
brew 'heroku'
brew 'htop-osx'
brew 'hub'
brew 'imagemagick@6'
brew 'ispell'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'mkcert'
brew 'neovim'
brew 'ngrep'
brew 'nmap'
brew 'openssl'
brew 'pango'
brew 'pinentry-mac'
brew 'prettyping'
brew 'roundup'
brew 'sem'
brew 'ssh-copy-id'
brew 'terraform'
brew 'terraform-docs'
brew 'thefuck'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'wifi-password'
brew 'zsh'

# gnu stuff
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'

# casks
unless ENV["CI"]
  tap 'homebrew/cask-cask'
  tap 'homebrew/cask-fonts'
  tap 'homebrew/cask-versions'

  cask '1password-cli'
  cask 'alfred'
  cask 'backblaze'
  cask 'bartender'
  cask 'caffeine'
  cask 'cheatsheet'
  cask 'cleanmymac'
  cask 'dash'
  cask 'docker'
  cask 'dropbox'
  cask 'fantastical'
  cask 'google-chrome'
  cask 'google-cloud-sdk'
  cask 'grammarly'
  cask 'imageoptim'
  cask 'iterm2'
  cask 'kaleidoscope'
  cask 'kap'
  cask 'keybase'
  cask 'postman'
  cask 'sketch'
  cask 'skyfonts'
  cask 'skype'
  cask 'slack'
  cask 'transmit'
  cask 'the-unarchiver'
  cask 'vlc'
  cask 'muzzle'
end

# fonts
unless ENV["CI"]
  cask 'caskroom/fonts/font-anonymouspro-nerd-font-mono'
  cask 'caskroom/fonts/font-awesome-terminal-fonts'
  cask 'caskroom/fonts/font-fira-code'
  cask 'caskroom/fonts/font-symbola'
  cask 'caskroom/fonts/font-fontawesome'
  cask 'caskroom/fonts/font-material-icons'
end

# MacApp Store Apps
unless ENV["CI"]
  mas "iStatistica", id: 1025822138
  mas "Kindle", id: 405399194
  mas "Keynote", id: 409183694
  mas "Numbers", id: 409203825
  mas "Pages", id: 409201541
  mas "1Password 7", id: 1333542190
  mas "Marked 2", id: 890031187
  mas "Todoist", id: 585829637
  mas "Monodraw", id: 920404675
  mas "Moom", id: 419330170
  mas "Spark", id: 1176895641
  mas "Deckset", id: 847496013
  mas "Xcode", id: 497799835
  mas "Bear", id: 1091189122
end
