cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'eqnxio/ngrok'
tap 'getantibody/tap'
tap 'neovim/neovim'
tap 'heroku/brew'
tap 'nektos/tap'


brew 'ack'
brew 'act'
brew 'adr-tools'
brew 'ag'
brew 'antibody'
test -z "$CI" &&
  brew 'awscli'
test -z "$CI" &&
  brew 'aws-vault'
brew 'bat'
brew 'cmake'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'editorconfig'
brew 'eqnxio/ngrok/ngrok'
brew 'exa'
brew 'fd'
brew 'gdk-pixbuf'
brew 'git'
brew 'glib'
brew 'gpg'
brew 'grc'
brew 'grep'
brew 'gzip'
brew 'heroku'
brew 'htop-osx'
brew 'hub'
brew 'ispell'
brew 'jq'
brew 'mackup'
brew 'neovim'
brew 'ngrep'
brew 'nmap'
brew 'openssl'
brew 'pango'
brew 'pinentry-mac'
brew 'prettyping'
brew 'roundup'
brew 'ssh-copy-id'
brew 'thefuck'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'zsh'

# gnu stuff
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'

# casks
unless ENV["CI"]
  tap 'homebrew/cask-versions'

  cask 'alfred'
  cask 'bartender'
  cask 'brave-browser'
  cask 'choosy'
  cask 'cleanmymac'
  cask 'dash'
  cask 'docker'
  cask 'fantastical'
  cask 'figma'
  cask 'google-chrome'
  cask 'grammarly'
  cask 'iterm2'
  cask 'kap'
  cask 'little-snitch'
  cask 'nordvpn'
  cask 'rocket'
  cask 'sublime-merge-dev'
  cask 'sublime-text-dev'
  cask 'visual-studio-code'
end
