cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'homebrew/devel-only'
tap 'eqnxio/ngrok'
tap 'd12frosted/emacs-plus'
tap 'getantibody/tap'
tap 'neovim/neovim'
tap "heroku/brew"

brew 'ack'
brew 'ag'
brew 'ansible'
brew 'antibody'
brew 'aspell', args: ['--with-lang-en']
brew 'awscli'
brew 'aws-elasticbeanstalk'
brew 'bat'
brew 'cairo'
brew 'composer'
brew 'curl', args: ["with-openssl"]
brew 'diff-so-fancy'
brew 'direnv'
brew 'editorconfig'
brew 'elixir'
brew 'emacs-plus', args: ["--HEAD", "--with-natural-title-bars"]
brew 'eqnxio/ngrok/ngrok'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'freetype'
brew 'fontconfig'
brew 'fzf'
brew 'gdk-pixbuf'
brew 'git'
brew 'glib'
brew 'gobject-introspection'
brew 'gpg'
brew 'grc'
brew 'grep'
brew 'gzip'
brew 'harfbuzz'
brew 'heroku'
brew 'htop-osx'
brew 'imagemagick@6'
brew 'ispell'
brew 'jq'
brew 'libcroco'
brew 'librsvg'
brew 'mackup'
brew 'mas'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'packer'
brew 'pango'
brew 'pinentry-mac'
brew 'pixman'
brew 'postgres'
brew 'prettyping'
brew 'rbenv'
brew 'roundup'
brew 'ruby-build'
brew 'shellcheck'
brew 'shfmt'
brew 'ssh-copy-id'
brew 'terraform'
brew 'terraform-docs'
brew 'thefuck'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'the_silver_searcher'
brew 'unrar'
brew 'vim', args: ['--override-system-vi']
brew 'wget'
brew 'wifi-password'
brew 'yarn'
brew 'zsh'

# gnu stuff
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'

# casks
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

cask '1password-cli'
cask 'alfred'
cask 'atom'
cask 'atom-beta'
cask 'backblaze'
cask 'bartender'
cask 'caffeine'
cask 'cheatsheet'
cask 'cleanmymac'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'duet'
cask 'encryptme'
cask 'fantastical'
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-cloud-sdk'
cask 'grammarly'
cask 'gyazo'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'kaleidoscope'
cask 'java'
cask 'java8'
cask 'kap'
cask 'keybase'
cask 'postman'
cask 'rocket'
cask 'skyfonts'
cask 'skype'
cask 'slack'
cask 'teamviewer'
cask 'transmit'
cask 'transmission'
cask 'the-unarchiver'
cask 'tunnelbear'
cask 'virtualbox'
cask 'vlc'

# https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'
cask 'qlvideo'

# fonts
cask 'caskroom/fonts/font-anonymouspro-nerd-font-mono'
cask 'caskroom/fonts/font-awesome-terminal-fonts'
cask 'caskroom/fonts/font-fira-code'
cask 'caskroom/fonts/font-symbola'
cask 'caskroom/fonts/font-fontaweSome'
cask 'caskroom/fonts/font-material-icons'


# MacApp Store Apps
# mas "Kindle", id: 405399194
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "iStat Mini", id: 927292435
# mas "1Password", id: 443987910
# mas "Marked 2", id: 890031187
# mas "Todoist", id: 585829637
# mas "Newton", id: 1059655371
# mas "Monodraw", id: 920404675
# mas "kset", id: 847496013
# mas "Tweetbot", id: 557168941
# mas "Xcode", id: 497799835
