cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'eqnxio/ngrok'
tap 'heroku/brew'
tap 'nektos/tap'


brew 'ack'
brew 'adr-tools'
brew 'ag'
brew 'awscli'
brew 'bat'
brew 'cmake'
brew 'curl'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'glib'
brew 'graphviz'
brew 'grc'
brew 'grep'
brew 'ripgrep'
brew 'gzip'
brew 'htop-osx'
brew 'ispell'
brew 'jq'
brew 'mackup'
brew 'ngrep'
brew 'nmap'
brew 'openssl'
brew 'prettyping'
brew 'starship'
brew 'tmux'
brew 'tmuxinator'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'zsh'

# # gnu stuff
# brew 'coreutils'
# brew 'findutils'
# brew 'gnu-tar'
# brew 'gnu-sed'
# brew 'gawk'
# brew 'gnutls'
# brew 'gnu-indent'
# brew 'gnu-getopt'

# casks
unless ENV["CI"]
  tap 'homebrew/cask-versions'
  tap 'homebrew/cask-fonts'

  cask 'alfred'
  cask 'bartender'
  cask 'choosy'
  cask 'cleanmymac'
  cask 'fantastical'
  cask 'figma'
  cask 'google-chrome'
  cask 'kap'
  cask 'kitty'
  cask 'little-snitch'
  cask 'nordvpn'
  cask 'rocket'
  cask 'sublime-merge-dev'
  cask 'sublime-text-dev'
  cask 'visual-studio-code'
end
